[{"hosts":["niamh"],"slug":"some-of-you-didnt-listen-to-8tracks-and-it-really-shows","name":"Some of you didn't listen to 8tracks and it really shows","description":"<p>The age of 8tracks was a simpler time. The wise few who know 8tracks can reminisce for an hour of nostalgia and those who clearly lacked taste in their teen years can receive a musical education. Each week a new painfully specific playlist revolving around a painfully specific scenario which always manages to have Lana del Rey's Born To Die in there somewhere.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/fie3j4Ck.jpg"},{"hosts":["carly","sarah"],"slug":"introspect","name":"Introspect","description":"<p>Introspect is the show that explores a different emotion or feeling each week, through music.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/10/Screen-Shot-2019-02-01-at-8.48.21-PM.png"},{"hosts":["andrew","caitlin"],"slug":"weird-loud-both","name":"WEIRD//LOUD//BOTH","description":"<p>Come along as we celebrate the unusual and the extreme in recorded music, i.e. I'll play you some weird and/or loud tracks and then talk about them in brief. It's good music for your lunch hour; drop on by.</p>","demo":"","pic":""},{"hosts":["leo"],"slug":"please-stand-up","name":"Please Stand Up","description":"<p>Every week I play a the work of a different hip hop artist. Working my way through their catalogue of music, coming out the other side with a better impression of them as an artist than when we went in.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/F25Nf-3M2.png"},{"hosts":["rosie","francesca","emily"],"slug":"brew-it-over","name":"Brew It Over","description":"<p>4 students brewing over the latest issues with a cup of tea in hand - every Saturday 10-11am</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/ba9Zkj6XK.png"},{"hosts":["sophieroadnight"],"slug":"good-chat","name":"good chat","description":"<p>A thoughtful and relatable conversation about everyday topics. With a new guest and a different topic every week, we discuss ideas such as identity and self expression; friends and family and what they mean; the body and its uses; food and nutrition; the environment; childhood, education and academia; and pretty much every single week; self-luuuuv. Very feel good. Get a cup of tea whilst you're listening.</p>","demo":"","pic":""},{"hosts":["freshair-member"],"slug":"the-pocket-book","name":"The Pocket Book","description":"<p>The Pocket Book is a weekly arts, pop-culture, and news radio show</p>","demo":"","pic":""},{"hosts":["john"],"slug":"alternate-current","name":"Alternate Current","description":"<p>Introducing Alternate Current, the indie electronic music show! Tune in weekly Tuesdays 15:00 for all the best things unconventional in the world of music. Sink in to the alternative acoustics, sultry synths and broody basses as we enlighten you on the genre-defining classics, as well as all the best new hits!</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/DXAoNQs4m.jpg"},{"hosts":["grace","honor","bronagh"],"slug":"espresso-adulting","name":"Espresso Adulting","description":"<p>All you need to know in a shot! Get ready for some good tunes and some not so good news.  Each week we take a major news story or issue and break down the historical and cultural context from which it has arisen, whether it’s the personal lives of politicians or democracy in Hong Kong, providing a basis for discussion and opinion-forming that challenges the click-bait culture of current affairs. Having framed the issue, we discuss ‘What’s happening now’, setting out and unpicking the situation in the present moment. It’s a newsroom with a backroom, talking through not only what’s going on, but what we can make of it. Headline news has a history.  Espresso Adulting takes the big issues you thought you’d be mulling over at dinner parties and distils them into a must-listen one-hour audio brief. It’s a strong grounding delivered in a speedy sip. It’s all you need to know in a single shot.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/DiRNr42YB.jpg"},{"hosts":["michel","rachel"],"slug":"pop-tasting","name":"POP TASTING","description":"<p>POP TASTING is a weekly music and pop culture show. Tune in to hear me play my favourite new releases &amp; timeless bops, and talk about celebrity news, artists on the rise, and more!<br>The show mainly includes Pop, Alternative, Hip-Hop/Rap and R&amp;B music.</p><p>POP TASTING is live on FreshAir.org.uk every Tuesday at 5PM.</p><p>Listen to some of the best tracks played on the show on Spotify and Apple Music: </p><figure class=\"kg-card kg-embed-card\"><iframe width=\"300\" height=\"380\" allowtransparency=\"true\" frameborder=\"0\" allow=\"encrypted-media\" title=\"Spotify Embed: The POP TASTING Playlist\" src=\"https://open.spotify.com/embed/playlist/4P7qjV9WDpRAz5NgiuSJsn?si=Uzm-iWiBQTKT4kAP5gDyGg\"></iframe></figure><p>Spotify: <a href=\"https://open.spotify.com/playlist/4P7qjV9WDpRAz5NgiuSJsn?si=yxWeAjA_Qa-7EJ7mzUes5A\">https://open.spotify.com/playlist/4P7qjV9WDpRAz5NgiuSJsn?si=yxWeAjA_Qa-7EJ7mzUes5A</a></p><p>Apple Music: <a href=\"https://music.apple.com/gb/playlist/the-pop-tasting-playlist/pl.u-9N9LaDWsx5eZ9Xr\">https://music.apple.com/gb/playlist/the-pop-tasting-playlist/pl.u-9N9LaDWsx5eZ9Xr</a></p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/10/POP-TASTING.jpg"},{"hosts":["rachel"],"slug":"sunday-roast","name":"Sunday Roast","description":"<p>Discussing the wildest socio-political phenomena in peak millennial fashion. Don't forget to tune in to listen to your resident angsty Gen-Zers (aka your favourite disaster duo) serving you that piping hot Sunday roast.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/10/IMG_1597-2.jpg"},{"hosts":["andrzej"],"slug":"radio-gra","name":"Radio Gra","description":"<p>I'm Andrew and this is my first radio show. Radio Gra is a show about music. Main focus is to talk about concerts I've been to recently and highlight interesting, underground artists. I want to introduce a lot of interesting acts in the Polish music scene. Main idea is just to share my passion for music with people and share the music I like. </p><p>Contact the show here: <a href=\"https://www.facebook.com/niespelnione.ambicje.reccs/\">https://www.facebook.com/niespelnione.ambicje.reccs/</a></p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/10/IMG_0416.jpg"},{"hosts":["beri"],"slug":"friday-evenings-with-beri","name":"Friday Evenings with Beri","description":"<p>A first year student trying her best to keep you entertained for an hour. Expect a mix of music and talking with segments that include:  ; Top news story or stories of the week,  ; Advice (email badvicewithberi@gmail.com to send questions which will  be kept anonymous),  ; Random chat and interviews depending on the week!  ; ?› Hope you tune in! ?›</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/ezqi5xOxb.jpg"},{"hosts":["sophie"],"slug":"the-sunday-sesh","name":"The Sunday Sesh","description":"<p>Sundays from 5-6pm, Sophie and Matthew bring you the best tunes, funny stories and banter the radio has to offer.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/Xum7XRmzH.png"},{"hosts":["finn","michaelforward"],"slug":"under-the-radar-with-finn-marsden","name":"Under the Radar with Finn Marsden","description":"<p>Under the Radar is your weekly showcase of the freshest and most exciting up and coming artists from across the UK. Live music and interviews from musicians from Edinburgh and beyond join us in the FreshAir.org.uk studio.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/lUeZJbMWe.jpg"},{"hosts":["michaelforward"],"slug":"popxpop","name":"POPxPOP","description":"<p>Highlights the best pop music from new alt-pop artists like SOPHIE to classics such as Lady Gaga.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2JEoY6KM0.png"},{"hosts":["molly"],"slug":"bops-and-bangers-of","name":"Bops and bangers of...","description":"<p>Each week a different city, each week the same old spiel of musical history.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/3nHB_E_NR.jpg"},{"hosts":["molly"],"slug":"east-meets-west","name":"East meets West","description":"<p>A fusion of pop music from around the world and cultural debate</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/U_Bg-3rf5.jpg"},{"hosts":["kyle","olly"],"slug":"sounds-good","name":"Sounds Good","description":"<p>Playing new and recent pop, indie and rock songs from the likes of Keane, Sigrid and The Script and a few classics too. Featuring entertainment updates on TV shows, film releases and local gigs.</p>","demo":"","pic":""},{"hosts":["gabriel"],"slug":"banana-pancakes","name":"Banana Pancakes","description":"<p>Picture this: Saturday afternoon. You're at the library pretending to do work/at home still trying to recover from last night/about to head on your 4th tinder date this month, and you tune in to Freshair.org.uk at 2pm.   ; Awful jokes, semi-good meal recipes, an unhealthy obsession with Kanye West and embarrassing stories as we come round and re-think our life choices. Banana Pancakes.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/odVbncpA1.jpg"},{"hosts":["alfie_steiner"],"slug":"itsjustmychat","name":"Itsjustmychat","description":"<p>'Itsjustmychat' is  a talk show, hosted by me, Alfie Steiner aka 'itsjustmymunch'. Whilst consistently featuring weekly culinary discussions, each week I will invite on a new guest, whose appearance will bring with it  a distinct topic to talk about. Every Monday, 11:00AM, my guests &amp; I will chat away, listening to some cracking tunes &amp; helping you start your week in the right way. </p>","demo":"","pic":"https://content.freshair.org.uk/content/images/s4CQK0dddf.jpg"},{"hosts":["julianna"],"slug":"spins-and-needles","name":"Spins and Needles","description":"<p>Spins and Needles curates rock n roll selections from “back in my day,” hosted by Julianna Ritzu and produced by Orlando Low; two people without the life experience to understand what that saying truly means. Guided by a theme each week, we will be bringing you a playlist of tunes to suit the occasion, covering buddy holly to bikini kill. So tune in and enjoy good music and unsolicited musical opinions from someone who should have had her mic turned off a long time ago.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/10/peanuts_33rpm-copy.jpg"},{"hosts":["george"],"slug":"the-queer-hour","name":"The Queer Hour","description":"<p>It's a fun, relaxed show, with discussions ranging from drag, to identity, to how to live life as your best self. It's a queer show, for queer (and straight) people to listen to, enjoy good music and every now and then there will be queer guests! So, if you're working on a fun art project, got something to say about a queer issue or just wanting to chat about queer literature - then get in touch! Follow us on twitter @HourQueer and we'll get back to you soon!</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/0JT-RDxMMq.jpg"},{"hosts":["poppy","zelda"],"slug":"soundtrack","name":"Soundtrack","description":"<p>Tune in every Saturday at 1pm-2pm for some niche situations and funky vibrations. Our soundtracks will provide you with an eclectic mix of songs against the background of a different weekly theme...</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/KPtrKn282r.jpg"},{"hosts":["dalia"],"slug":"the-dizzy-show","name":"The Dizzy Show","description":"<p>Dedicated to the roots of hip hop, the Dizzy Show is all about the backstories and the culture of what is rap. Spanning from coast to coast of America, to the British rap scene and beyond, to having locals live broadcasting their own music on the air; delving into the archives of jazz, RnB, blues, motown influences... each week will be unpacking a different side of the history of hip hop. </p><p>Saturdays from 6pm - 7pm on FreshAir. </p>","demo":"","pic":"https://content.freshair.org.uk/content/images/YgxvIP3Fdi.jpg"},{"hosts":["meredith"],"slug":"omg-and","name":"OMG AND","description":"<p>The title of the show came from me realising just how often I say 'Omg, and..' when telling my friends about new songs, albums and musical announcements. So this show is me extending that conversation - telling you about new songs, older songs I've just discovered and love, and news from bands and celebrities I'm invested in!</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/10/omg-and-radio-pic.jpg"},{"hosts":["joe-weinstein"],"slug":"mojo","name":"MoJo","description":"<p>The show which takes a certain year, period, genre or place and explores all that it musically has to offer. Great tracks, interviews, guests and everything in-between.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/12/78530469_3305872332776022_1902688765739008000_n.png"},{"hosts":["jennifer"],"slug":"hidden-gems","name":"Hidden Gems","description":"<p>Tune in every Sunday at 4-5pm to hear some musical hidden gems - songs that are underrated, from popular artists as well as small indie bands, and new releases that aren't getting as much attention as they should be. Don't forget to get involved on twitter @HiddenGemsEdi !</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/10/hgpinkorangescaled-2.png"},{"hosts":["tobias"],"slug":"the-beatnik","name":"The Beatnik","description":"<p>The Beatnik will aim to cover all music from acid to afrobeat, and everything in between, with some current happenings and general chatter thrown in. We also aim to have a real focus on Edinburgh by bringing local DJs on for guest mixes, as well as interviews with the main movers and shakers in the city’s music scene.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/N7cCjjQCxs.jpg"},{"hosts":["maisiewills","esme"],"slug":"mixed-feelings","name":"Mixed Feelings","description":"<p>a mixtape specifically created for all our strange nd oddly specific emotions each week, with some chats about the songs and how being able to soundtrack our lives makes us feel</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/10/Screenshot-2019-10-15-at-00.15.53.png"},{"hosts":["hannah","brodie"],"slug":"whats-a-girl-to-do","name":"What’s a Girl to Do?","description":"<p>Two gals discussing how they navigate the world around them</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/BoJN0QD0wK.jpg"},{"hosts":["jelena"],"slug":"the-arts-show","name":"The Arts Show","description":"<p>The Arts Show on FreshAir.org.uk, with Jelena Sofronijevic. Tune in every week for exclusive reviews, interviews, and events from Edinburgh’s diverse arts scene – from theatre to literature, film to the visual arts.</p>","demo":"","pic":""},{"hosts":["evan"],"slug":"eardrum-solo","name":"Eardrum Solo","description":"<p>Music has been my passion for as long as I can remember. My taste stretches from traditional African hymns to metal and beyond, and I honestly have trouble sharing this with a lot of my friends without feeling like a \"DID YOU KNOW THAT...\"-type of guy. So I basically want to talk about, and play some music while telling stories and giving a few opinions in between.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/CRDBQ19wGo.jpg"},{"hosts":["ella"],"slug":"its-all-happening","name":"It’s All Happening","description":"<p>Each week I give my dream soundtrack for one of my favorite movies</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/r7HkyJQUC6.jpg"},{"hosts":["jason","mikhail"],"slug":"two-dutch-boys","name":"Two Dutch Boys","description":"<p>A show dedicated to underrated music of all genres. Expect DJ mixes with a focus on UK underground music as well as more chilled out shows that include conversations with special guests</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/SEpRb0nM.jpg"},{"hosts":["peter"],"slug":"added-time","name":"Added Time","description":"<p>Each week, a crack team of armchair fans and want-to-be pundits give their take on the biggest sporting stories of the week. Consider us Arsenal Fan TV minus the shouting and swearing, but bigger and bolder opinions.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/10/IMG_0010.JPG"},{"hosts":["lara","fiona"],"slug":"made-in-walford","name":"Made in Walford","description":"<p>Drawing influence from the bastions of civilisation that are their home towns, Walford serves as a fictional utopia that Lara and Fiona hope to escape to / think into existence if they talk about it enough live on air. You're welcome to come along for the ride.</p><p>Saturdays 3-4pm</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/ck__bh7Ms.png"},{"hosts":["owen","nicholas"],"slug":"808s-hot-takes","name":"808s & Hot Takes","description":"<p>Playing and discussing all kinds of music (mainly hip hop) giving you tracks you already love, and new music you're soon to love. With weekly reviews, discoveries and news!</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/at1JEg6Kn.png"},{"hosts":["richenda"],"slug":"old-new-borrowed-blue","name":"Old New Borrowed Blue","description":"<p>Old New Borrowed Blue, presented by Natasha Swan and Richenda Rae, has been broadcasting on FreshAir.org.uk since 2016\\. The show brings you discussion and all the best tracks from the four categories of Old Music, New Music, Foreign-Language Music, and Scottish Music.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/ZNBv0NejE.jpg"},{"hosts":["ryan"],"slug":"activism-airwaves","name":"Activism Airwaves","description":"<p>Explores various forms of activism and engages with activists to learn more about what they do. The show includes activism inspired music, interviews with activists, and exploration of various related topics.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/DXLmLBIS.jpg"},{"hosts":["emily-anderson","felix","niamh"],"slug":"reasonably-good-chat","name":"Reasonably Good Chat","description":"<p>'Reasonably Good Chat' is exactly what it says on the tin (we hope) - join Emily and Felix every Friday from 10-11am for an hour of music and chat about pop culture, politics and everything in between...</p>","demo":"","pic":""},{"hosts":["monica","polly"],"slug":"2g","name":"2G","description":"<p>Music show - mostly rap; hip hop; RnB; soul</p>","demo":"","pic":""},{"hosts":["ella"],"slug":"freshair-news","name":"Freshair News","description":"<p>Your news from around the world and right here in Edinburgh delivered by 6 cool peeps</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/4gt6wJWn1.jpg"},{"hosts":["alexhersey"],"slug":"close-enuf","name":"Close Enuf","description":"<p>Close Enuf is a weekly music show where each track connects of relates somehow to the one before it, taking listeners on the wild ride that is the music biz.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/NBMUr_NBb.jpg"},{"hosts":["ella-taylor"],"slug":"tunes-for-the-times","name":"Tunes for the Times","description":"<p>A show to commemorate the happenings of our contemporary world; all of its hardships, happiness, and harmonies. I will be bringing on regular guests to discuss contemporary environmental issues as well as to share music and poetry that make us all feel some type of way. This will be a show combining current events, politics, and sustainability along with music that relates to the topics we will be discussing as well as tunes to allow the listener a bit of a breather to reflect on what was discussed.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/0tDvmzdJA.jpg"},{"hosts":["freshair-member"],"slug":"heard-of","name":"Heard Of","description":"<p>Each week we listen to an artist or album that we haven't 'heard of' and then discuss our thoughts, feelings and discoveries on our show, as well as playing particular songs we liked. Every so often we will have guests on to discuss an artist they love who we also haven't heard of, or we share a new artist with one another.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/dH_IwZl7V.jpg"},{"hosts":["will","peter","alfie_steiner","olly"],"slug":"freshair-sports-hub","name":"FreshAir Sports Hub","description":"<p>Weekly show dedicated to bringing you the latest sports news from around the world, reports from Hearts and Hibs games, as well as debates and discussion covering a range of sporting events!</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/10/freshairsport.jpg"},{"hosts":["krzysztof","shinwoo"],"slug":"edisci","name":"EdiSci","description":"<p>A conversation between science students, discussing university life as STEM students and having the occasional interviews</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/RqP_OwVOB.png"},{"hosts":["bella","ella-radley"],"slug":"orange-juice","name":"Orange Juice","description":"<p>A large serving of SEGMENTS... with lots of... JUICY BITS and a garnish of VITAMIN C. An hour of miscellaneous larks and G O O D SONGS with Ella and Bella.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/Bnh2gUS9M.jpg"},{"hosts":["flora"],"slug":"four-weddings-and-a-tuna-roll","name":"Four Weddings and a Tuna Roll","description":"<p>Old friends and easy tuna.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/kO4jZ8Mob.jpg"},{"hosts":["fergus","miles"],"slug":"the-hour-of-power","name":"The Hour of Power","description":"<p>This is an informal chat show, which discusses uni life in general with a particular attention on sports. A variety of music will be played, but mainly hip-hop.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/zUoQZA1vT.jpg"},{"hosts":["ben"],"slug":"sport-summary","name":"Sport Summary","description":"<p>It would be me discussing the biggest sports news/results of the week (weekly show) with some guest phone-ins to offer better insight/analysis of other sports and music in between segments - mainly 70/80s/90s music.</p>","demo":"","pic":""},{"hosts":["hannah-ruddy"],"slug":"post-credits-show","name":"Post-Credits Show","description":"<p>a show about film, and music, and film music. listen in for tunes from, and talk about, every possible film - except bohemian rhapsody</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/rhF5N-wtQ.jpg"},{"hosts":["monica"],"slug":"thats-hot","name":"That’s Hot","description":"<p>That’s Hot is the show with a musical theme every week ranging from genre’s and vibes. Matched with a discussion or a guest on the show.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/KDipyvGM.jpg"},{"hosts":["nathaniel"],"slug":"2-dudes-one-bloke","name":"2 Dudes & one Bloke","description":"<p>Music focused show, most genres get played but centers around experimental rap and r&amp;b, world music, and dance genres. Dialogue includes commentary about music scenes and comparisons of growing up in London, Chicago and rural United States as our presenters are all from different places. Last 10-15 minutes is a discussion of new albums</p>","demo":"","pic":""},{"hosts":["helene"],"slug":"electro-worldwide","name":"Electro WorldWide","description":"<p>I´ll choose a different region or country each week and introduce you to the electronic music from around there that I know and enjoy. I might also share tidbits of the artists and electro scene around there.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/e24ZhQu4J.jpg"},{"hosts":["joe"],"slug":"sound-of-scotland","name":"Sound of Scotland","description":"<p>Bringing you an hour of music from all over the country, Sound of Scotland plays new and old Scottish tunes as well as some songs you didn’t know were Scottish</p>","demo":"","pic":""},{"hosts":["kyle"],"slug":"thats-the-tune","name":"That’s the Tune","description":"<p>Hello!!  ; Welcome to that’s the tune, a show that explores music taste evolution.  ; Each week, Hannah, her Freshair producer Kyle play and discuss music chosen by a different guest. Songs/artists that represent or have meant something to the guest at a particular time will be played in chronological order (from childhood until present).   ; We attempt to explore a strangers personality and story, in just one hour, through their music taste, its evolution - and linked anecdotes.   ; Tune in to that’s the tune, every wednesday from 4-5pm.</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/hrowd2SH9.jpg"},{"hosts":["freshair-member"],"slug":"glenn-sours-magical-hour","name":"Glenn Sour's Magical Hour","description":"<p>Funk, Soul and Disco Show</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/11/glenn-sour1.jpg"},{"hosts":["freshair-member"],"slug":"wisdom","name":"Wisdumb","description":"<p>Wisdumb is a discussion/comedy show where presenters Ed Meltzer and Cassandra Sawtell give dumb answers to those seeking wise advice on life and current affairs.</p>","demo":"","pic":""},{"hosts":["mel","julianna"],"slug":"just-girly-things","name":"Just Girly Things","description":"<p>Just some girls chattin about \"Just Girly Things\"... jkjk We are a group of intelligent young women who share our down-to-earth insight on topical issues of the week paired with some bangin tunes. So tune in for the tunes ;)</p>","demo":"","pic":"https://content.freshair.org.uk/content/images/2019/11/72831701_750960352045945_8839087706425262080_n.jpg"},{"hosts":["samuel-penalosa"],"slug":"general-election-2019","name":"General Election 2019","description":"<p>Tune in for our live broadcast, bringing you the latest news from constituencies across the country</p>","demo":"","pic":""}]